
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НачалоДня(Договор.ДатаНачала) > Дата Или Дата > КонецДня(Договор.ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	
	ПС = Символы.ПС;
	ТекстСообщения = "";
	
	Если ЭтоНовый() Тогда
		ТекстСообщения =""+ТекущаяДата()+": Создан новый документ ""Обслуживание клиента"""+ПС+
		"Дата документа: "+Дата+", Номер: "+Номер+ПС+
		"Клиент: "+Клиент+ПС+
		"Специалист: "+Специалист+ПС+
		"Дата проведения работ: "+ДатаПроведенияРабот+ПС+
		"Описание проблемы: "+ОписаниеПроблемы+ПС;
	ИначеЕсли Модифицированность() Тогда
		ТекстСообщения =""+ТекущаяДата()+": Изменен документ ""Обслуживание клиента"""+ПС+ 
		"Дата документа: "+Ссылка.Дата+", Номер: "+Номер+ПС+
		"Внесены изменения в Реквизиты:"+ПС+
		?(Ссылка.Дата<>Дата,"Дата документа: "+Дата+ПС,"")+
		?(Ссылка.Клиент<>Клиент,"Клиент: "+Клиент+ПС,"")+
		?(Ссылка.Специалист<>Специалист,"Специалист: "+Специалист+ПС,"")+
		?(Ссылка.ДатаПроведенияРабот<>ДатаПроведенияРабот,"Дата проведения работ: "+ДатаПроведенияРабот+ПС,"")+
		?(Ссылка.ОписаниеПроблемы<>ОписаниеПроблемы,"Описание проблемы: "+ОписаниеПроблемы+ПС,"");
	КонецЕсли;
	
	//ТокенБота = Константы.ТокенУправленияТелеграмБотом.Получить();
	//ChatID = Константы.ИдентификаторГруппыДляОповещения.Получить();
		
	Если ТекстСообщения <> "" Тогда
		НовыйЭлементСправочника = Справочники.УведомленияТелеграмБоту.СоздатьЭлемент();
		НовыйЭлементСправочника.ТекстСообщения = ТекстСообщения;
		НовыйЭлементСправочника.Записать();
		//ТелеграмКлиентСервер.ОтправитьСообщениеВTelegram(ТекстСообщения, ТокенБота, ChatID);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движение = Движения.ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	Движение.КоличествоЧасов = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	Движение.СуммаКОплате = Договор.ЧасоваяСтавка * Движение.КоличествоЧасов; 
КонецПроцедуры

#КонецОбласти
#КонецЕсли

