
Функция ОтправитьСообщениеВTelegramПеред() Экспорт
	Token = Константы.ТокенУправленияТелеграмБотом.Получить();  // Токен бота
	IdGroup = Константы.ИдентификаторГруппыДляОповещения.Получить();  // ID группы или чата
	ЭлементыСправочника = Справочники.УведомленияТелеграмБоту.Выбрать();
	Пока ЭлементыСправочника.Следующий() Цикл
		Результат = ОтправитьСообщениеВTelegram(ЭлементыСправочника.ТекстСообщения, Token, IdGroup);
		Если Результат = 200 Тогда
			ДокументОбъект = ЭлементыСправочника.Ссылка.ПолучитьОбъект();
			ДокументОбъект.Удалить();
		КонецЕсли;
	КонецЦикла;
КонецФункции 
	
#Если Не ВебКлиент Тогда 
Функция ОтправитьСообщениеВTelegram(ТекстСообщения, ТокенБота, ChatID) Экспорт
	АдресТелеграм = "api.telegram.org";
	Token = ТокенБота;  // Токен бота
	IdGroup = ChatID;  // ID группы или чата
	Сообщение = ТекстСообщения;
	
	Если Не ЗначениеЗаполнено(Сообщение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Формирование строки параметров
	СтрокаПараметров = "chat_id=" + IdGroup + "&parse_mode=html&text=" + Сообщение;
	
	// HTTP-запрос
	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.Заголовки.Вставить("Connection", "keep-alive");
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	HTTPЗапрос.Заголовки.Вставить("GET /enter HTTP/1.1");  // Для GET-метода
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, "utf-8");
	HTTPЗапрос.АдресРесурса = "/bot" + Token + "/sendMessage";
	
	Попытка
		Соединение = Новый HTTPСоединение(
			АдресТелеграм,  // сервер
			443,  // порт для HTTPS
			,  // пользователь (если нужен)
			,  // пароль (если нужен)
			,  // прокси (если нужен)
			30,  // таймаут
			Новый ЗащищенноеСоединениеOpenSSL()
		);
		
		ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();
		Возврат ОтветHTTP.КодСостояния;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецФункции

#КонецЕсли